app/controllers/events_controller.rb

    def show
      id = params[:id] # retrieve event ID from URI route
      u = current_user.username
      @event = Event.find(id) # look up event by unique ID
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]

    def index
      # TODO: record user during login
      # session[:username] = 'testuser'

      #check for search query string
      q = params[:q].to_s.strip

      if not q.blank?
        # TODO issue #70
        event1 = Event.find_event_by_date(params[:select][:year], params[:select][:month])
        event3 = Event.find_event_by_status(params[:status_selected])
        event4 = Event.find_event_by_name(q)
        @events = [ event1, event3, event4 ].reject( &:nil? ).reduce( :& )
        @users = {}
        @events.each do |event|
          u = User.find_by(username: event.host)
          @users[event.host] = u
        end
        @page_name = "Search Result for '#{q}'"
      else
        @events = Event.all
---
SELECT "events".* FROM "events"

    def myEvents
      @username = current_user.username # TODO: session[:username]
      @host_events = Event.find_all_host_events(@username)
      @host_events = [] if @host_events.nil? or @host_events.empty?
---
SELECT  "events".* FROM "events" WHERE "events"."host" = ? LIMIT 1  [["host", "Mysaria"]]
SELECT "events".* FROM "events"
SELECT COUNT(*) FROM "events" WHERE "events"."host" = ?  [["host", "Mysaria"]]