app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @emovies = Movie.all